particle-iot/device-os/platform/MCU/nRF52840/src/flash_mal.c
static bool parse_compressed_module_header(flash_device_t dev, uintptr_t addr, size_t size, compressed_module_header* header) {
    if (size < sizeof(module_info_t) + sizeof(compressed_module_header)) {
        return false;
    }
    if (!flash_read(dev, addr + sizeof(module_info_t), (uint8_t*)header, sizeof(compressed_module_header))) {
        return false;
    }
    if (header->size > sizeof(compressed_module_header) && size < sizeof(module_info_t) + header->size) {
        return false;
    }
    if (header->method != 0) { // Raw Deflate
        return false;
    }
    return true;
}

#endif // HAS_COMPRESSED_OTA

bool FLASH_CheckValidAddressRange(flash_device_t flashDeviceID, uint32_t startAddress, uint32_t length)
{
    // FIXME: remove magic numbers
    uint32_t endAddress = startAddress + length - 1;

    if (flashDeviceID == FLASH_INTERNAL)
    {
        return (startAddress >= 0x00000000 && endAddress <= 0x100000) ||
               (startAddress >= 0x12000000 && endAddress <= 0x20000000);
    }
    else if (flashDeviceID == FLASH_SERIAL)
    {
#ifdef USE_SERIAL_FLASH
        return startAddress >= 0x00000000 && endAddress <= EXTERNAL_FLASH_SIZE;
#else
        return false;
#endif
    }
    else
    {
        return false;   //Invalid FLASH ID
    }

    return true;
}

bool FLASH_EraseMemory(flash_device_t flashDeviceID, uint32_t startAddress, uint32_t length)
{
    uint32_t numSectors;

    if (FLASH_CheckValidAddressRange(flashDeviceID, startAddress, length) != true)
    {
        return false;
    }

    if (flashDeviceID == FLASH_INTERNAL)
    {
        numSectors = CEIL_DIV(length, INTERNAL_FLASH_PAGE_SIZE);

        if (hal_flash_erase_sector(startAddress, numSectors) != 0)
        {
            return false;
        }

        return true;
    }
#ifdef USE_SERIAL_FLASH
    else if (flashDeviceID == FLASH_SERIAL)
    {
        numSectors = CEIL_DIV(length, sFLASH_PAGESIZE);

        if (hal_exflash_erase_sector(startAddress, numSectors) != 0)
        {
            return false;
        }

        return true;
    }
#endif

    return false;
}

int FLASH_CheckCopyMemory(flash_device_t sourceDeviceID, uint32_t sourceAddress,
                      flash_device_t destinationDeviceID, uint32_t destinationAddress,
                      uint32_t length, uint8_t module_function, uint8_t flags)
{
    size_t dest_size = length;
    if (flags & MODULE_COMPRESSED) {
#if HAS_COMPRESSED_OTA
        compressed_module_header header = { 0 };
        if (!parse_compressed_module_header(sourceDeviceID, sourceAddress, length, &header)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
        dest_size = header.original_size;
#else
        return FLASH_ACCESS_RESULT_BADARG;
#endif // !HAS_COMPRESSED_OTA
    }
    if (!verify_module(sourceDeviceID, sourceAddress, length, destinationDeviceID, destinationAddress, dest_size,
            module_function, flags)) {
        return FLASH_ACCESS_RESULT_BADARG;
    }
    return FLASH_ACCESS_RESULT_OK;
}

int FLASH_CopyMemory(flash_device_t sourceDeviceID, uint32_t sourceAddress,
                     flash_device_t destinationDeviceID, uint32_t destinationAddress,
                     uint32_t length, uint8_t module_function, uint8_t flags)
{
    size_t dest_size = length;
#if HAS_COMPRESSED_OTA
    compressed_module_header comp_header = { 0 };
    if (flags & MODULE_COMPRESSED) {
        if (!parse_compressed_module_header(sourceDeviceID, sourceAddress, length, &comp_header)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
        dest_size = comp_header.original_size;
    }
#endif // HAS_COMPRESSED_OTA
    if (!verify_module(sourceDeviceID, sourceAddress, length, destinationDeviceID, destinationAddress, dest_size,
            module_function, flags)) {
        return FLASH_ACCESS_RESULT_BADARG;
    }
#if SOFTDEVICE_MBR_UPDATES
    if (module_function == MODULE_FUNCTION_BOOTLOADER && destinationAddress == USER_FIRMWARE_IMAGE_LOCATION) {
        // Backup user firmware
        dest_size = CEIL_DIV(length, INTERNAL_FLASH_PAGE_SIZE) * INTERNAL_FLASH_PAGE_SIZE;
        if (!FLASH_EraseMemory(FLASH_SERIAL, EXTERNAL_FLASH_RESERVED_ADDRESS, dest_size)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
        if (!flash_copy(FLASH_INTERNAL, USER_FIRMWARE_IMAGE_LOCATION, FLASH_SERIAL, EXTERNAL_FLASH_RESERVED_ADDRESS, dest_size)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
        // Add backed up partial user firmware to slots, so that it's restored on next boot
        if (!FLASH_AddToNextAvailableModulesSlot(FLASH_SERIAL, EXTERNAL_FLASH_RESERVED_ADDRESS, FLASH_INTERNAL,
                USER_FIRMWARE_IMAGE_LOCATION, dest_size, MODULE_FUNCTION_NONE, 0)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
    }
#endif // SOFTDEVICE_MBR_UPDATES

    if (!FLASH_EraseMemory(destinationDeviceID, destinationAddress, dest_size)) {
        return FLASH_ACCESS_RESULT_ERROR;
    }
    if (flags & MODULE_COMPRESSED) {
#if HAS_COMPRESSED_OTA
        // Skip the module info and compressed data headers
        if (length < sizeof(module_info_t) + comp_header.size + 2 /* Prefix size */ + 4 /* CRC-32 */) { // Sanity check
            return FLASH_ACCESS_RESULT_BADARG;
        }
        sourceAddress += sizeof(module_info_t) + comp_header.size;
        length -= sizeof(module_info_t) + comp_header.size + 4;
        // Determine where the compressed data ends
        uint16_t prefix_size = 0;
        if (!flash_read(sourceDeviceID, sourceAddress + length - 2, (uint8_t*)&prefix_size, 2)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
        if (length < prefix_size) {
            return FLASH_ACCESS_RESULT_BADARG;
        }
        length -= prefix_size;
        if (!flash_decompress(sourceDeviceID, sourceAddress, length, destinationDeviceID, destinationAddress, dest_size)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
#else
        return FLASH_ACCESS_RESULT_BADARG;
#endif // !HAS_COMPRESSED_OTA
    } else {
        // XXX: Device OS versions < 2.0.0 may not be setting this flag in the module slots!
        // Bootloader should rely on the actual flags within the module header!
        if (!(flags & MODULE_DROP_MODULE_INFO) && (flags & MODULE_VERIFY_MASK)) {
            // We may only check the module header if we've been asked to verify it
            uint32_t infoOffset = 0;
            const module_info_t* info = FLASH_ModuleInfo(sourceDeviceID, sourceAddress, &infoOffset);
            if (info->flags & MODULE_INFO_FLAG_DROP_MODULE_INFO) {
                // NB: We have corner cases where the module info is not located in the
                // front of the module but for example after the vector table and we
                // only want to enable this feature in the case it is in the front,
                // hence the module_info_t located at the the source address check.
                if (infoOffset == 0) {
                    // Skip module header
                    flags |= MODULE_DROP_MODULE_INFO;
                } else {
                    return FLASH_ACCESS_RESULT_ERROR;
                }
            }
        }
        if (flags & MODULE_DROP_MODULE_INFO) {
            // Skip the module info header
            if (length < sizeof(module_info_t)) { // Sanity check
                return FLASH_ACCESS_RESULT_BADARG;
            }
            sourceAddress += sizeof(module_info_t);
            length -= sizeof(module_info_t);
        }
        if (!flash_copy(sourceDeviceID, sourceAddress, destinationDeviceID, destinationAddress, length)) {
            return FLASH_ACCESS_RESULT_ERROR;
        }
    }

#if SOFTDEVICE_MBR_UPDATES
    if (module_function == MODULE_FUNCTION_BOOTLOADER && destinationAddress == USER_FIRMWARE_IMAGE_LOCATION) {
        sd_mbr_command_t command = {
            .command = SD_MBR_COMMAND_COPY_BL,
            .params.copy_bl.bl_src = (uint32_t*)destinationAddress,
            // length is in words!
            .params.copy_bl.bl_len = CEIL_DIV(length, 4)
        };

        uint32_t mbr_result = sd_mbr_command(&command);
        if (!mbr_result) {
            // We are anyway returning reset pending state here
            // in order for the bootloader to immediately reset and restore the
            // application module.
            return FLASH_ACCESS_RESULT_RESET_PENDING;
        }
        // We will not reach this point actually, as MBR will reset automatically
        return FLASH_ACCESS_RESULT_RESET_PENDING;
    }
#endif // SOFTDEVICE_MBR_UPDATES
    return FLASH_ACCESS_RESULT_OK;
}

